org-init/modeline-custom.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>modeline-custom</title>
<!-- 2015-02-03 Tue 12:11 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Toby Tripp" />
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.2/css/bootstrap.min.css">
<link rel="stylesheet" href="css/config.css">
<link rel="stylesheet" href="css/htmlize.css">
</head>
<body>
<div id="content">
<h1 class="title">modeline-custom</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Modeline</h2>
<div class="outline-text-2" id="text-1">
<p>
By default, the modeline in Emacs will show you information about
everything.  Unfortunately, by trying to show you everything, it
ends up showing you little of actual use.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Smart Mode Line</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The <a href="https://github.com/Bruce-Connor/smart-mode-line">smart-mode-line</a> package gives you some control of what shows up in the mode-line.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>require-package 'smart-mode-line<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">require</span> '<span style="color: #268bd2; font-weight: bold;">smart-mode-line</span> nil 'noerror<span style="color: #b58900;">)</span>
    <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">progn</span>
      <span style="color: #268bd2;">(</span>setq sml/name-width 20<span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>setq sml/mode-width 'full<span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>setq sml/shorten-directory t<span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>setq sml/shorten-modes t<span style="color: #268bd2;">)</span>

      <span style="color: #268bd2;">(</span>rich-minority-mode 1<span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>setq rm-blacklist '<span style="color: #dc322f;">(</span><span style="color: #2aa198;">" GitGutter"</span> <span style="color: #2aa198;">" MRev"</span> <span style="color: #2aa198;">" company"</span> <span style="color: #2aa198;">" mate"</span> <span style="color: #2aa198;">" Projectile"</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>

      <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> after-init-time
        <span style="color: #dc322f;">(</span>sml/setup<span style="color: #dc322f;">)</span>
        <span style="color: #dc322f;">(</span>add-hook 'after-init-hook 'sml/setup<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>

      <span style="color: #268bd2;">(</span>require-package 'smart-mode-line-powerline-theme<span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>sml/apply-theme 'powerline<span style="color: #268bd2;">)</span>
      <span style="color: #586e75;">;; </span><span style="color: #586e75;">Alternatives:</span>
      <span style="color: #586e75;">;; </span><span style="color: #586e75;">(sml/apply-theme 'powerline)</span>
      <span style="color: #586e75;">;; </span><span style="color: #586e75;">(sml/apply-theme 'dark)</span>
      <span style="color: #586e75;">;; </span><span style="color: #586e75;">(sml/apply-theme 'light)</span>
      <span style="color: #586e75;">;; </span><span style="color: #586e75;">(sml/apply-theme 'respectful)</span>
      <span style="color: #586e75;">;; </span><span style="color: #586e75;">(sml/apply-theme 'automatic)</span>

      <span style="color: #268bd2;">(</span>add-to-list 'sml/replacer-regexp-list '<span style="color: #dc322f;">(</span><span style="color: #2aa198;">"^~/Dropbox/"</span> <span style="color: #2aa198;">":DB:"</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>add-to-list 'sml/replacer-regexp-list '<span style="color: #dc322f;">(</span><span style="color: #2aa198;">"^~/Code/"</span> <span style="color: #2aa198;">":CODE:"</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>add-to-list 'sml/replacer-regexp-list '<span style="color: #dc322f;">(</span><span style="color: #2aa198;">"^:CODE:investor-bridge"</span> <span style="color: #2aa198;">":IB:"</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>add-to-list 'sml/replacer-regexp-list '<span style="color: #dc322f;">(</span><span style="color: #2aa198;">"^~/.*/lib/ruby/gems"</span> <span style="color: #2aa198;">":GEMS"</span> <span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Showing the Time</h3>
<div class="outline-text-3" id="text-1-2">
<p>
24-hour time, of course:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>setq display-time-24hr-format t<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>display-time-mode 1<span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Tripp</p>
<p class="date">Created: 2015-02-03 Tue 12:11</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
